NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/incompressible/simpleFoam/rotatingCylinders/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication $(getApplication)
./plot

#------------------------------------------------------------------------------
